---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderPersistentIds.#ctor(Autodesk.Revit.DB.BRepBuilder)
source: html/657afa4a-9115-e65e-c69a-9571817478b5.htm
---
# Autodesk.Revit.DB.BRepBuilderPersistentIds.#ctor Method

Constructs a new BRepBuilderPersistentIds and associates the existing BRepBuilder to it.

## Syntax (C#)
```csharp
public BRepBuilderPersistentIds(
	BRepBuilder bRepBuilder
)
```

## Parameters
- **bRepBuilder** (`Autodesk.Revit.DB.BRepBuilder`) - The existing BRepBuilder.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null